данный файл является конфигурационным файлом приложения и содержит настройки в которых нет секретных данных, поэтому
данный файл может быть добавлен в систему контроля версий, таких как например GIT. Настройки содержащие секретные данные
можно хранить в файле .env либо, как в случае данного приложения, создать конфигурационный файл - config.py

#1 следующая настройка устанавливает переменную окружения, в которой указывается какой файл является основным. Например
если запустить команду фласк - flask run, то фласк уже будет знать какой файл нужно запускать. Зная путь к этому файлу,
Flask может запустить сервер, применить миграции базы данных или открыть интерактивную консоль (flask shell).
FLASK_APP=microblog.py

#2 это включает режим отладки, при котором сервер будет сам перезагружаться после сохранения файлов.
FLASK_DEBUG=1